app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" DESC  [["post_id", 20]]
---
    </div>
    <% @post.comments.order(created_at: :desc).each do |comment| %>