app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Nouveau commentaire"], ["created_at", "2023-09-21 00:13:16.066216"], ["updated_at", "2023-09-21 00:13:16.066216"], ["user_id", 11], ["post_id", 2]]
---
  def create
    @post = Post.find_by(id: params["post_id"])
    @comment = Comment.new
    @comment.content = params["comment"]["content"]
    @comment.user_id = current_user.id
    @comment.post_id = @post.id
    if @comment.save