app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.order(created_at: :desc)

INSERT INTO "posts" ("title", "content", "url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.url = "http://" + @post.url if @post.url.starts_with?("http://", "https://") == false
    @post.user_id = current_user.id
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
  def set_post_id
    @post = Post.find_by(id: params["id"])